# Inequality Operator

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalResourceType..::..Inequality Operator
ExternalResourceType Class See Also
---
Compares two ExternalResourceType instances.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static bool operator !=(
	ExternalResourceType first,
	ExternalResourceType second
)
```

Visual Basic
---
```text
Public Shared Operator <> ( _
	first As ExternalResourceType, _
	second As ExternalResourceType _
) As Boolean
```

Visual C++
---
```text
public:
static bool operator !=(
	ExternalResourceType^ first,
	ExternalResourceType^ second
)
```

# ### Parameters
first
    Type: Autodesk.Revit.DB..::..ExternalResourceTypeThe first ExternalResourceType.
second
    Type: Autodesk.Revit.DB..::..ExternalResourceTypeThe second ExternalResourceType.
# ### Return Value
True if the inputs are different, false if they are identical.
# See Also
ExternalResourceType Class
Autodesk.Revit.DB Namespace